app/controllers/accounts_controller.rb

  def create
    @account = Account.new(params[:account])
    @account.license = params[:license]
    gon.errors = @account.errors
    if @account.save
---
INSERT INTO "accounts" ("api_token", "created_at", "created_by", "description", "domain", "license", "name", "slug", "updated_at", "updated_by") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def destroy
    @account.destroy
---
DELETE FROM "accounts" WHERE "accounts"."id" = $1  [["id", 2]]