app/controllers/api_oauths_controller.rb

  def create
    j = GRuby::Auth.token(params[:code])
    a = current_user.api_oauths.ga.where(refresh_token: j["refresh_token"]).first
    if j["refresh_token"].present? and a.blank?
      a = Api::Oauth.new(user_id: current_user.id, app: "GA", refresh_token: j["refresh_token"])
    end
    a.token = j["access_token"]
    a.token_expires_at = Time.now + j["expires_in"]
    a.save
---
INSERT INTO "api_oauths" ("app", "created_at", "created_by", "email", "name", "refresh_token", "token", "token_expires_at", "updated_at", "updated_by", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"