app/controllers/data_files_controller.rb

  def index
    @data_files = @account.data_files.where(category: @folder)
---
SELECT "data_files".* FROM "data_files" WHERE "data_files"."account_id" = 2 AND "data_files"."category" = 'data' LIMIT 1

  def pull
    @data_query = Data::Query.find(params[:qid])
---
SELECT "data_queries".* FROM "data_queries" WHERE "data_queries"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
    if @data_file.update_attributes(params[:data_file])
---
UPDATE "data_files" SET "content" = '', "commit_message" = '', "updated_at" = '2013-12-22 12:27:21.340352' WHERE "data_files"."id" = 3